# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州广台高速-1）
"""
default = {
    1: [863, 862],
    2: [904, 900],
    3: [937, 932],
    4: [970, 965],
    5: [1003, 998],
    6: [1049, 1042],
    7: [1082, 1075],
    8: [1114, 1108],
    9: [1147, 1141],
    10: [1189, 1181]
}
pixel_ratio = 8.66  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.601704501, 2.577281439]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.419441044, 3.052199397]  # 经过统计后的货车宽度范围
