# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州广台高速-2）
"""
default = {
    1: [963, 988],
    2: [1005, 1024],
    3: [1038, 1057],
    4: [1072, 1090],
    5: [1105, 1122],
    6: [1151, 1164],
    7: [1184, 1197],
    8: [1217, 1230],
    9: [1251, 1263],
    10: [1292, 1300]
}
pixel_ratio = 8.66  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.62814605216826, 2.62779977885472]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.35573926777928, 3.05432907360448]  # 经过统计后的货车宽度范围
