# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州广台高速-3）
"""
default = {
    1: [916, 920],
    2: [948, 955],
    3: [981, 988],
    4: [1014, 1020],
    5: [1047, 1053],
    6: [1086, 1091],
    7: [1119, 1123],
    8: [1152, 1155],
    9: [1185, 1187],
    10: [1219, 1221]
}
pixel_ratio = 8.66  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.46011739870314, 2.37934260075788]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.17822291847733, 2.79985104493235]  # 经过统计后的货车宽度范围
