# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州广台高速-5）
"""
default = {
    1: [917, 919],
    2: [948, 955],
    3: [981, 988],
    4: [1013, 1020],
    5: [1046, 1052],
    6: [1087, 1090],
    7: [1119, 1123],
    8: [1152, 1155],
    9: [1185, 1187],
    10: [1218, 1223]
}
pixel_ratio = 8.66  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.47948373935299, 2.41901806274291]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.18777675359535, 2.79124498612849]  # 经过统计后的货车宽度范围
