# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州环城高速-11）
"""
default = {
    1: [968, 923],
    2: [998, 953],
    3: [1031, 988],
    4: [1064, 1023],
    5: [1097, 1058],
    6: [1126, 1087],
    7: [1159, 1121],
    8: [1194, 1157],
    9: [1228, 1192],
    10: [1257, 1223]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.72970919874213, 2.76550115496838]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.59993362560313, 3.17943159693045]  # 经过统计后的货车宽度范围
