# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州环城高速-8）
"""
default = {
    1: [942, 915],
    2: [971, 946],
    3: [1006, 982],
    4: [1039, 1017],
    5: [1072, 1053],
    6: [1100, 1082],
    7: [1132, 1117],
    8: [1168, 1153],
    9: [1201, 1189],
    10: [1230, 1220]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.64462608896645, 2.62943810113784]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.44332624147669, 2.9562628762833]  # 经过统计后的货车宽度范围
