# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州环城高速-6）
"""
default = {
    1: [961, 920],
    2: [989, 950],
    3: [1023, 983],
    4: [1056, 1018],
    5: [1089, 1053],
    6: [1118, 1082],
    7: [1150, 1116],
    8: [1182, 1151],
    9: [1217, 1186],
    10: [1247, 1216]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.66898100298473, 2.65310449217844]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.46026344740809, 3.12435858394055]  # 经过统计后的货车宽度范围
