# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州环城高速-3）
"""
default = {
    1: [930, 918],
    2: [958, 947],
    3: [991, 981],
    4: [1025, 1016],
    5: [1057, 1051],
    6: [1084, 1079],
    7: [1117, 1112],
    8: [1151, 1147],
    9: [1184, 1182],
    10: [1213, 1212]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.51815644144019, 2.46872095789341]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.31294140487194, 2.79325133162016]  # 经过统计后的货车宽度范围
