# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州环城高速-9）
"""
default = {
    1: [925, 920],
    2: [955, 950],
    3: [987, 985],
    4: [1021, 1021],
    5: [1055, 1057],
    6: [1081, 1087],
    7: [1115, 1122],
    8: [1149, 1158],
    9: [1182, 1193],
    10: [1212, 1224]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.5627081025595, 2.57172414848164]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.34030852696133, 2.94455843778487]  # 经过统计后的货车宽度范围
