# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州环城高速-10）
"""
default = {
    1: [922, 877],
    2: [952, 909],
    3: [985, 944],
    4: [1020, 980],
    5: [1055, 1016],
    6: [1084, 1046],
    7: [1116, 1081],
    8: [1151, 1116],
    9: [1186, 1152],
    10: [1216, 1182]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.78972107822322, 2.81362454604612]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.57330619294441, 3.28088228460532]  # 经过统计后的货车宽度范围
