# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州环城高速-2.2）
"""
default = {
    1: [957, 916],
    2: [986, 946],
    3: [1020, 981],
    4: [1053, 1016],
    5: [1085, 1052],
    6: [1114, 1081],
    7: [1147, 1114],
    8: [1182, 1149],
    9: [1215, 1184],
    10: [1245, 1213]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.71872152038, 2.69305053736267]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.63336411848462, 3.02867224228495]  # 经过统计后的货车宽度范围
