# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州环城高速-4）
"""
default = {
    1: [966, 937],
    2: [995, 967],
    3: [1027, 999],
    4: [1062, 1034],
    5: [1093, 1069],
    6: [1121, 1098],
    7: [1154, 1131],
    8: [1187, 1166],
    9: [1221, 1200],
    10: [1250, 1230]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.61766958030317, 2.56787698863707]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.41864476746585, 2.88598222655345]  # 经过统计后的货车宽度范围
