# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-1）
"""
default = {
    1: [999, 959],
    2: [1026, 990],
    3: [1060, 1023],
    4: [1093, 1058],
    5: [1127, 1088],
    6: [1152, 1112],
    7: [1185, 1145],
    8: [1220, 1180],
    9: [1254, 1214],
    10: [1282, 1243]
}
pixel_ratio = 9.33  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.50062779591085, 2.37851333856901]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.36737302618484, 2.62833613421199]  # 经过统计后的货车宽度范围
