# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-20）
"""
default = {
    1: [946, 952],
    2: [972, 975],
    3: [1005, 1008],
    4: [1038, 1039],
    5: [1072, 1070],
    6: [1095, 1090],
    7: [1128, 1122],
    8: [1161, 1153],
    9: [1193, 1184],
    10: [1220, 1210]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.35039608787447, 2.31462079194669]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.11297055912398, 2.55177339305728]  # 经过统计后的货车宽度范围
