# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-8）
"""
default = {
    1: [892, 940],
    2: [918, 962],
    3: [948, 993],
    4: [980, 1024],
    5: [1010, 1055],
    6: [1034, 1076],
    7: [1065, 1106],
    8: [1095, 1138],
    9: [1126, 1170],
    10: [1152, 1196]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.53395648552222, 2.44513145544688]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.18670355378561, 2.76878516728731]  # 经过统计后的货车宽度范围
