# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-13）
"""
default = {
    1: [965, 964],
    2: [992, 989],
    3: [1023, 1020],
    4: [1055, 1052],
    5: [1086, 1082],
    6: [1110, 1102],
    7: [1142, 1133],
    8: [1174, 1165],
    9: [1206, 1197],
    10: [1232, 1223]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.35995968131243, 2.34043430052029]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.04379030114768, 2.70963486345949]  # 经过统计后的货车宽度范围
