# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-8）
"""
default = {
    1: [946, 952],
    2: [972, 978],
    3: [1004, 1010],
    4: [1036, 1042],
    5: [1068, 1073],
    6: [1091, 1092],
    7: [1121, 1123],
    8: [1154, 1155],
    9: [1186, 1188],
    10: [1212, 1212]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.31199165944577, 2.27297556080183]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.12783987574086, 2.5335896386165]  # 经过统计后的货车宽度范围
