# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-6.1）
"""
default = {
    1: [959, 985],
    2: [985, 1009],
    3: [1015, 1039],
    4: [1045, 1069],
    5: [1075, 1098],
    6: [1098, 1118],
    7: [1128, 1147],
    8: [1158, 1178],
    9: [1190, 1208],
    10: [1215, 1236]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.47757316664818, 2.37436976625165]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.23181584758459, 2.70960324670974]  # 经过统计后的货车宽度范围
