# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-6.2）
"""
default = {
    1: [976, 960],
    2: [1002, 984],
    3: [1032, 1014],
    4: [1063, 1044],
    5: [1093, 1074],
    6: [1116, 1093],
    7: [1146, 1122],
    8: [1176, 1152],
    9: [1208, 1182],
    10: [1233, 1210]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.51832649638378, 2.52755517617895]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.37279658940363, 3.00091748291555]  # 经过统计后的货车宽度范围
