# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-4）
"""
default = {
    1: [905, 961],
    2: [930, 987],
    3: [961, 1017],
    4: [992, 1049],
    5: [1022, 1080],
    6: [1048, 1101],
    7: [1077, 1132],
    8: [1108, 1163],
    9: [1139, 1195],
    10: [1165, 1222]
}
pixel_ratio = 8.27  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.50074976002225, 2.38840971280943]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.1774065761971, 2.62734448221937]  # 经过统计后的货车宽度范围
