# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-1）
"""
default = {
    1: [930, 950],
    2: [955, 975],
    3: [986, 1006],
    4: [1018, 1038],
    5: [1050, 1069],
    6: [1074, 1089],
    7: [1103, 1119],
    8: [1135, 1149],
    9: [1168, 1183],
    10: [1192, 1208]
}
pixel_ratio = 8.27  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.26683899098222, 2.26614390991693]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.05129744213259, 2.50587329796125]  # 经过统计后的货车宽度范围
