# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-5.2）
"""
default = {
    1: [930, 934],
    2: [957, 960],
    3: [988, 990],
    4: [1018, 1020],
    5: [1050, 1051],
    6: [1072, 1072],
    7: [1102, 1100],
    8: [1132, 1132],
    9: [1164, 1163],
    10: [1189, 1188]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.37355231465569, 2.41076631825547]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.12333367655225, 2.62966831448313]  # 经过统计后的货车宽度范围
