# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-12）
"""
default = {
    1: [946, 966],
    2: [971, 992],
    3: [1003, 1025],
    4: [1035, 1057],
    5: [1067, 1088],
    6: [1090, 1108],
    7: [1121, 1140],
    8: [1153, 1172],
    9: [1184, 1204],
    10: [1210, 1231]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.41497676812917, 2.2998362275072]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.05383569641785, 2.51390812449617]  # 经过统计后的货车宽度范围
