# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-17）
"""
default = {
    1: [882, 930],
    2: [907, 955],
    3: [938, 986],
    4: [970, 1017],
    5: [1002, 1048],
    6: [1024, 1068],
    7: [1055, 1097],
    8: [1084, 1128],
    9: [1116, 1159],
    10: [1140, 1184]
}
pixel_ratio = 8.27  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.44957505021631, 2.30281638912762]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.15392862598185, 2.53662006977556]  # 经过统计后的货车宽度范围
