# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-5.1）
"""
default = {
    1: [1018, 970],
    2: [1043, 995],
    3: [1074, 1026],
    4: [1104, 1056],
    5: [1134, 1086],
    6: [1158, 1106],
    7: [1188, 1136],
    8: [1219, 1168],
    9: [1249, 1198],
    10: [1275, 1224]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.72253966256131, 2.46473622117658]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.61507235052698, 2.92287190664883]  # 经过统计后的货车宽度范围
