# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-7.2）
"""
default = {
    1: [926, 958],
    2: [951, 984],
    3: [981, 1012],
    4: [1012, 1042],
    5: [1042, 1072],
    6: [1066, 1090],
    7: [1093, 1118],
    8: [1124, 1148],
    9: [1154, 1178],
    10: [1180, 1202]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.4878085652194, 2.3116892448375]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.17986678559618, 2.56087465977923]  # 经过统计后的货车宽度范围
