# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-3.1）
"""
default = {
    1: [970, 948],
    2: [996, 970],
    3: [1027, 1000],
    4: [1059, 1030],
    5: [1088, 1058],
    6: [1110, 1079],
    7: [1140, 1106],
    8: [1172, 1135],
    9: [1203, 1165],
    10: [1228, 1190]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.517445065225, 2.42282085176893]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.33149624651772, 2.86772896359894]  # 经过统计后的货车宽度范围
