# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-6.1）
"""
default = {
    1: [957, 951],
    2: [983, 976],
    3: [1016, 1008],
    4: [1046, 1039],
    5: [1079, 1071],
    6: [1102, 1091],
    7: [1132, 1121],
    8: [1165, 1152],
    9: [1196, 1184],
    10: [1222, 1210]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.52149788974509, 2.3417218108048]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.31124870971617, 2.67060344428114]  # 经过统计后的货车宽度范围
