# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-10）
"""
default = {
    1: [940, 954],
    2: [967, 979],
    3: [997, 1009],
    4: [1028, 1039],
    5: [1058, 1069],
    6: [1082, 1090],
    7: [1110, 1119],
    8: [1142, 1149],
    9: [1172, 1180],
    10: [1197, 1206]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.38893787008841, 2.35907324068675]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.15067062097439, 2.69365311764429]  # 经过统计后的货车宽度范围
