# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-11）
"""
default = {
    1: [934, 955],
    2: [960, 982],
    3: [992, 1014],
    4: [1025, 1046],
    5: [1057, 1077],
    6: [1080, 1098],
    7: [1112, 1128],
    8: [1145, 1161],
    9: [1178, 1193],
    10: [1204, 1219]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.41834619921294, 2.37081810787066]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.14451691856867, 2.55210858582085]  # 经过统计后的货车宽度范围
