# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-14）
"""
default = {
    1: [920, 936],
    2: [946, 960],
    3: [978, 991],
    4: [1010, 1023],
    5: [1042, 1054],
    6: [1066, 1074],
    7: [1097, 1104],
    8: [1130, 1135],
    9: [1162, 1167],
    10: [1187, 1198]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.34683580847137, 2.30822170088093]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.10699688544723, 2.5037948262967]  # 经过统计后的货车宽度范围
