# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-18）
"""
default = {
    1: [918, 943],
    2: [944, 967],
    3: [977, 1000],
    4: [1010, 1031],
    5: [1042, 1062],
    6: [1067, 1082],
    7: [1097, 1113],
    8: [1130, 1145],
    9: [1162, 1177],
    10: [1188, 1202]
}
pixel_ratio = 8.27  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.40574846961276, 2.40898793182391]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.01282864275623, 2.60884604888215]  # 经过统计后的货车宽度范围
