# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-15）
"""
default = {
    1: [928, 957],
    2: [953, 982],
    3: [985, 1012],
    4: [1017, 1044],
    5: [1048, 1075],
    6: [1071, 1095],
    7: [1101, 1125],
    8: [1131, 1156],
    9: [1164, 1188],
    10: [1190, 1214]
}
pixel_ratio = 8.27  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.39389736714265, 2.2890717143889]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.11776418640639, 2.57610408999085]  # 经过统计后的货车宽度范围
