# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-3.2）
"""
default = {
    1: [1022, 1084],
    2: [1049, 1107],
    3: [1080, 1138],
    4: [1109, 1168],
    5: [1142, 1198],
    6: [1164, 1219],
    7: [1195, 1248],
    8: [1227, 1278],
    9: [1259, 1310],
    10: [1285, 1335]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.56943281079053, 2.23866546021659]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.34659046605767, 2.62999896906393]  # 经过统计后的货车宽度范围
