# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(初采)-4）
"""
default = {
    1: [979, 948],
    2: [1004, 972],
    3: [1035, 1003],
    4: [1068, 1033],
    5: [1098, 1063],
    6: [1122, 1083],
    7: [1152, 1111],
    8: [1185, 1142],
    9: [1217, 1172],
    10: [1242, 1196]
}
pixel_ratio = 8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.54467193317047, 2.56067075746431]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.43270942075527, 2.96950612159698]  # 经过统计后的货车宽度范围
