# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-5）
"""
default = {
    1: [946, 968],
    2: [971, 993],
    3: [1002, 1023],
    4: [1034, 1054],
    5: [1065, 1084],
    6: [1087, 1103],
    7: [1118, 1133],
    8: [1149, 1164],
    9: [1180, 1196],
    10: [1205, 1222]
}
pixel_ratio = 8.27  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.33720839996518, 2.26983147880043]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.10025274340931, 2.58227511509913]  # 经过统计后的货车宽度范围
