# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-6.2）
"""
default = {
    1: [954, 952],
    2: [980, 978],
    3: [1012, 1009],
    4: [1044, 1041],
    5: [1076, 1072],
    6: [1099, 1091],
    7: [1130, 1121],
    8: [1162, 1154],
    9: [1194, 1184],
    10: [1219, 1210]
}
pixel_ratio = 8.27  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.41710607287055, 2.34277760800095]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.15685710271427, 2.59106827655634]  # 经过统计后的货车宽度范围
