# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-2）
"""
default = {
    1: [940, 950],
    2: [966, 976],
    3: [998, 1007],
    4: [1030, 1039],
    5: [1062, 1070],
    6: [1084, 1089],
    7: [1114, 1119],
    8: [1148, 1152],
    9: [1180, 1183],
    10: [1206, 1208]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.36011393891396, 2.29981889364367]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.01633505560058, 2.48858355668872]  # 经过统计后的货车宽度范围
