# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（广州沈海高速(补采)-9）
"""
default = {
    1: [930, 958],
    2: [957, 984],
    3: [989, 1016],
    4: [1021, 1048],
    5: [1054, 1080],
    6: [1077, 1100],
    7: [1109, 1132],
    8: [1142, 1164],
    9: [1174, 1196],
    10: [1200, 1222]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 30  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.40297706676349, 2.393492917386]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.08034081586805, 2.58954214798419]  # 经过统计后的货车宽度范围
