# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海沪昆高速-2）
"""
default = {
    1: [923, 928],
    2: [949, 952],
    3: [984, 995],
    4: [1018, 1019],
    5: [1053, 1052],
    6: [1091, 1088],
    7: [1125, 1121],
    8: [1160, 1154],
    9: [1195, 1189],
    10: [1219, 1212]
}
pixel_ratio = 9.33  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.37314416389261, 2.23981710720611]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.17989930167493, 2.52446613791373]  # 经过统计后的货车宽度范围
