# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海沪昆高速-5）
"""
default = {
    1: [928, 920],
    2: [952, 943],
    3: [985, 976],
    4: [1017, 1010],
    5: [1050, 1043],
    6: [1086, 1078],
    7: [1118, 1111],
    8: [1151, 1144],
    9: [1185, 1178],
    10: [1208, 1201]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.34049423828972, 2.30514685353233]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.00841370972826, 2.60316590280667]  # 经过统计后的货车宽度范围
