# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海沪昆高速-7）
"""
default = {
    1: [944, 935],
    2: [968, 957],
    3: [1000, 990],
    4: [1032, 1022],
    5: [1064, 1057],
    6: [1100, 1092],
    7: [1131, 1124],
    8: [1163, 1157],
    9: [1196, 1190],
    10: [1220, 1216]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.32150179162955, 2.37724215131706]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.05699919809009, 3.13188049313286]  # 经过统计后的货车宽度范围
