# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海沪昆高速-6）
"""
default = {
    1: [973, 940],
    2: [994, 964],
    3: [1028, 998],
    4: [1061, 1032],
    5: [1092, 1068],
    6: [1128, 1098],
    7: [1160, 1133],
    8: [1193, 1167],
    9: [1226, 1201],
    10: [1250, 1224]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.36323729773738, 2.30743044627257]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.19044943566389, 2.72558782047662]  # 经过统计后的货车宽度范围
