# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海沪昆高速-1.2）
"""
default = {
    1: [952, 940],
    2: [975, 964],
    3: [1010, 998],
    4: [1045, 1032],
    5: [1080, 1055],
    6: [1120, 1091],
    7: [1152, 1133],
    8: [1188, 1167],
    9: [1226, 1201],
    10: [1247, 1224]
}
pixel_ratio = 9.33  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.43819236025965, 2.38091660654143]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.30571104811602, 2.83349810361277]  # 经过统计后的货车宽度范围
