# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海沪昆高速-8）
"""
default = {
    1: [933, 926],
    2: [957, 949],
    3: [991, 982],
    4: [1024, 1015],
    5: [1057, 1048],
    6: [1094, 1084],
    7: [1125, 1117],
    8: [1158, 1150],
    9: [1192, 1184],
    10: [1216, 1208]
}
pixel_ratio = 9.07  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.30639951753121, 2.2162766767218]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.06449587746346, 2.68551287131845]  # 经过统计后的货车宽度范围
