# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海沪昆高速-3）
"""
default = {
    1: [901, 920],
    2: [926, 945],
    3: [961, 977],
    4: [996, 1010],
    5: [1031, 1041],
    6: [1070, 1077],
    7: [1103, 1107],
    8: [1137, 1130],
    9: [1172, 1172],
    10: [1197, 1196]
}
pixel_ratio = 9.33  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.36892226556899, 2.25429771326097]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.02051749087417, 2.6671419906191]  # 经过统计后的货车宽度范围
