# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海沪昆高速-10）
"""
default = {
    1: [901, 934],
    2: [924, 956],
    3: [957, 988],
    4: [992, 1019],
    5: [1024, 1050],
    6: [1062, 1085],
    7: [1094, 1115],
    8: [1129, 1145],
    9: [1162, 1176],
    10: [1187, 1201]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.40845362033908, 2.29006371260681]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.09978599382051, 2.73235155274113]  # 经过统计后的货车宽度范围
