# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-2.2）
"""
default = {
    1: [935, 944],
    2: [965, 972],
    3: [997, 1006],
    4: [1030, 1039],
    5: [1061, 1071],
    6: [1102, 1114],
    7: [1135, 1145],
    8: [1168, 1179],
    9: [1201, 1212],
    10: [1228, 1240]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.44382153068449, 2.39820578805748]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.18507352225552, 2.99485912201375]  # 经过统计后的货车宽度范围
