# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-3）
"""
default = {
    1: [932, 934],
    2: [959, 963],
    3: [992, 996],
    4: [1025, 1029],
    5: [1058, 1061],
    6: [1095, 1101],
    7: [1128, 1132],
    8: [1161, 1166],
    9: [1193, 1198],
    10: [1219, 1225]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.38612364609276, 2.44825126905265]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.14898052840277, 2.93411959131049]  # 经过统计后的货车宽度范围
