# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-7.2）
"""
default = {
    1: [912, 995],
    2: [944, 1024],
    3: [977, 1056],
    4: [1013, 1088],
    5: [1045, 1116],
    6: [1088, 1160],
    7: [1122, 1189],
    8: [1156, 1222],
    9: [1188, 1251],
    10: [1222, 1283]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.70981213334333, 2.58304345705457]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.33763814692825, 2.95580290868638]  # 经过统计后的货车宽度范围
