# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-1）
"""
default = {
    1: [892, 949],
    2: [918, 973],
    3: [950, 1005],
    4: [983, 1037],
    5: [1016, 1067],
    6: [1060, 1106],
    7: [1091, 1138],
    8: [1124, 1170],
    9: [1156, 1201],
    10: [1186, 1228]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.50252284307715, 2.37306817303256]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.10266485998848, 2.74479807949887]  # 经过统计后的货车宽度范围
