# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-7.1）
"""
default = {
    1: [933, 928],
    2: [964, 958],
    3: [997, 988],
    4: [1031, 1020],
    5: [1064, 1050],
    6: [1107, 1091],
    7: [1138, 1120],
    8: [1171, 1152],
    9: [1204, 1184],
    10: [1236, 1213]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.4928404149221, 2.38176401969581]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.30819619661574, 2.95346104101635]  # 经过统计后的货车宽度范围
