# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-11）
"""
default = {
    1: [953, 954],
    2: [982, 983],
    3: [1014, 1015],
    4: [1046, 1047],
    5: [1077, 1079],
    6: [1117, 1118],
    7: [1149, 1149],
    8: [1181, 1180],
    9: [1212, 1212],
    10: [1241, 1241]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.37558007819493, 2.36776578910137]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.13883483224787, 2.88935943514389]  # 经过统计后的货车宽度范围
