# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-13）
"""
default = {
    1: [919, 926],
    2: [951, 955],
    3: [984, 987],
    4: [1017, 1019],
    5: [1051, 1052],
    6: [1094, 1088],
    7: [1125, 1117],
    8: [1159, 1149],
    9: [1192, 1182],
    10: [1222, 1209]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.4242776535501, 2.42785860547413]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.20926391976869, 2.8287856468319]  # 经过统计后的货车宽度范围
