# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-2.1）
"""
default = {
    1: [922, 935],
    2: [951, 963],
    3: [984, 996],
    4: [1017, 1031],
    5: [1049, 1063],
    6: [1090, 1104],
    7: [1121, 1136],
    8: [1155, 1169],
    9: [1187, 1203],
    10: [1214, 1231]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.58412723223927, 2.44414690024853]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.37293229563396, 2.95786870883512]  # 经过统计后的货车宽度范围
