# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-15.1）
"""
default = {
    1: [965, 930],
    2: [993, 959],
    3: [1025, 992],
    4: [1057, 1025],
    5: [1089, 1058],
    6: [1130, 1097],
    7: [1162, 1129],
    8: [1194, 1162],
    9: [1226, 1195],
    10: [1252, 1224]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.64296554550681, 2.51162035678764]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.40654672149246, 3.22548580039818]  # 经过统计后的货车宽度范围
