# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-14）
"""
default = {
    1: [933, 935],
    2: [960, 963],
    3: [993, 996],
    4: [1025, 1028],
    5: [1057, 1060],
    6: [1096, 1101],
    7: [1128, 1133],
    8: [1161, 1166],
    9: [1193, 1198],
    10: [1219, 1225]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.39052291197672, 2.51908830375506]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.17632352354118, 2.94488092014533]  # 经过统计后的货车宽度范围
