# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-1）
"""
default = {
    1: [901, 897],
    2: [931, 922],
    3: [963, 956],
    4: [996, 990],
    5: [1028, 1022],
    6: [1070, 1062],
    7: [1102, 1093],
    8: [1135, 1125],
    9: [1167, 1157],
    10: [1195, 1182]
}
pixel_ratio = 8.53  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.51495641757729, 2.48591047880978]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.28346259163642, 3.17594754779904]  # 经过统计后的货车宽度范围
