# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-5）
"""
default = {
    1: [923, 945],
    2: [950, 973],
    3: [984, 1006],
    4: [1017, 1039],
    5: [1050, 1070],
    6: [1090, 1110],
    7: [1122, 1142],
    8: [1155, 1175],
    9: [1188, 1207],
    10: [1215, 1231]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.41669857708512, 2.37755305459119]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.16923314909761, 2.88842585350415]  # 经过统计后的货车宽度范围
