# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-15.2）
"""
default = {
    1: [965, 932],
    2: [992, 961],
    3: [1024, 993],
    4: [1057, 1026],
    5: [1089, 1058],
    6: [1129, 1099],
    7: [1160, 1132],
    8: [1193, 1165],
    9: [1226, 1197],
    10: [1252, 1225]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.6578533701472, 2.54784743453162]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.34944178940547, 3.20791199592673]  # 经过统计后的货车宽度范围
