# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海绕城高速-1）
"""
default = {
    1: [965, 930],
    2: [992, 959],
    3: [1024, 992],
    4: [1057, 1025],
    5: [1089, 1058],
    6: [1129, 1097],
    7: [1160, 1129],
    8: [1193, 1162],
    9: [1226, 1196],
    10: [1252, 1224]
}
pixel_ratio = 8.8  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.63168268297913, 2.55976524056118]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.3326417368945, 3.25828648378768]  # 经过统计后的货车宽度范围
