# !/usr/bin/python
# coding=utf-8

"""
道路配置参数（上海申嘉湖高速-1）
"""
default = {
    1: [952, 916],
    2: [978, 942],
    3: [1011, 975],
    4: [1044, 1009],
    5: [1070, 1042],
    6: [1152, 1122],
    7: [1185, 1155],
    8: [1217, 1188],
    9: [1250, 1221],
    10: [1280, 1251]
}
pixel_ratio = 8.66  # 画面像素和实际单位的比例，像素:米的比例
exclude_left_x = 0  # 排除左边的x左边值，单位米
statistics_car_height_range = [1.77802538565424, 2.6008404007167]  # 经过统计后的轿车宽度范围
statistics_truck_height_range = [2.50683982319794, 3.46490130483996]  # 经过统计后的货车宽度范围
